package com.example.banglaquotes.MainActivitys;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.os.Bundle;
import android.view.Menu;
import android.view.MenuItem;
import android.widget.Toast;

import com.example.banglaquotes.R;
import com.example.banglaquotes.adapters.MyAdapter;
import com.example.banglaquotes.adapters.Quotes;

import java.util.ArrayList;
import java.util.List;

public class MainActivity extends AppCompatActivity {
    private Toolbar toolbar;
    private RecyclerView recyclerView;
    private List<Quotes> list;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        toolbar = findViewById(R.id.toolbar);
        recyclerView = findViewById(R.id.recyclerviewId);
        setSupportActionBar(toolbar);
        list = new ArrayList<>();
        list.add(new Quotes(R.drawable.kazinazrulislam,"কাজী নজরুল ইসলাম",
                "[●] তুমি সুন্দর তাই চেয়ে থাকি প্রিয়, সে কি মোর অপরাধ? চাঁদেরে হেরিয়া কাঁদে চকোরিণী বলে না তো কিছু চাঁদ ~ কাজী নজরুল ইসলাম\n" +
                        " [●] সে দেশে যবে বাদল ঝরে কাঁদে না কি প্রাণ একেলা ঘরে, বিরহ ব্যথা নাহি কি সেথা বাজে না বাঁশি নদীর তীরে।। ~ কাজী নজরুল ইসলাম\n" +
                        " [●] চাঁদ হেরিছে চাঁদমুখ তার সরসীর আরশিতে ছোটে তরঙ্গ বাসনা ভঙ্গ সে অঙ্গ পরশিতে। ~ কাজী নজরুল ইসলাম\n" +
                        " [●] কোনকালে একা হয়নিকো জয়ী, পূরুষের তরবারী; প্রেরনা দিয়েছে, শক্তি দিয়াছে, বিজয়ালক্ষী নারী ~ কাজী নজরুল ইসলাম\n" +
                        " [●] খেলিছ এ বিশ্ব লয়ে বিরাট শিশু আনমনে। প্রলয় সৃষ্টি তব পুতুল খেলা নিরজনে প্রভু নিরজনে। ~ কাজী নজরুল ইসলাম\n" +
                        " [●] স্বপনে কি যে কয়েছি তাই গিয়াছে চলে জাগিয়া কেদে ডাকি দেবতায় প্রিয়তম প্রিয়তম প্রিয়তম।। ~ কাজী নজরুল ইসলাম\n" +
                        " [●] বসন্ত এলো এলো এলোরে পঞ্চম স্বরে কোকিল কুহুরে মুহু মুহু কুহু কুহু তানে মাধবী নিকুঞ্জে পুঞ্জে পুঞ্জে ভ্রমর গুঞ্জে গুঞ্জে গুনগুন গানে ~ কাজী নজরুল ইসলাম\n" +
                        " [●] ভালবাসার কোন অর্থ বা পরিমাণ নেই ~ কাজী নজরুল ইসলাম\n" +
                        " [●] নুড়ি হাজার বছর ঝরণায় ডুবে থেকেও রস পায় না ~ কাজী নজরুল ইসলাম\n" +
                        " [●] মসজিদেরই পাশে আমার কবর দিও ভাই যেন গোরে থেকেও মোয়াজ্জিনের আজান শুনতে পাই। ~ কাজী নজরুল ইসলাম\n" +
                        " [●] আমি বিদ্রোহী ভৃগু, ভগবান বুকে এঁকে দিই পদ-চিহ্ন ~ কাজী নজরুল ইসলাম\n" +
                        " [●] বসন্ত এলো এলো এলো রে পঞ্চম স্বরে কোকিল কুহরে মুহু মুহু কুহু কুহু তানে ~ কাজী নজরুল ইসলাম\n" +
                        " [●] বল বীর-বল উন্নত মম শির! শির নেহারী আমারি নতশির ওই শিখর হিমাদ্রীর ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] গগনে কৃষ্ণ মেঘ দোলে – কিশোর কৃষ্ণ দোলে বৃন্দাবনে থির সৌদামিনী রাধিকা দোলে নবীন ঘনশ্যাম সনে; দোলে রাধা শ্যাম ঝুলন-দোলায় দোলে আজি শাওনে ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] মিথ্যা শুনিনি ভাই এই হৃদয়ের চেয়ে বড় কোনও মন্দির-কাবা নাই ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] কারার ঐ লৌহকপাট, ভেঙ্গে ফেল কর রে লোপাট, রক্ত-জমাট শিকল পূজার পাষাণ-বেদী। ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] শিহরি উঠো না শাস্ত্রবিদেরের ক’রোনা ক’ বীর ভয় তাহারা খোদার খোদ ‘প্রাইভেট সেক্রেটারি’ তো নয় ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] শুণ্যে মহা আকাশে তুমি মগ্ন লীলা বিলাসে ভাঙ্গিছো গড়িছো নীতি ক্ষণে ক্ষণে নির্জনে প্রভু নির্জনে খেলিছো ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] অঞ্জলি লহ মোর সংগীতে প্রদীপ-শিখা সম কাঁপিছে প্রাণ মম তোমারে সুন্দর, বন্দিতে সঙ্গীতে।। ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] গিন্নির চেয়ে শালী ভালো ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] তোমারে যে চাহিয়াছে ভুলে একদিন, সে জানে তোমারে ভোলা কি কঠিন ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] বিশ্ব যখন এগিয়ে চলেছে, আমরা তখনও বসে- বিবি তালাকের ফতোয়া খুঁজেছি, ফিকাহ ও হাদিস চষে ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] আসিবে তুমি জানি প্রিয় আনন্দে বনে বসন্ত এলো ভুবন হল সরসা, প্রিয়-দরশা, মনোহর। বনানতে পবন অশান্ত হল তাই কোকিল কুহরে, ঝরে গিরি নির্ঝরিণী ঝর ঝর ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] আমার যাবার সময় হল দাও বিদায় মোছ আঁখি দুয়ার খোল দাও বিদায়।। ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] যেদিন আমি হারিয়ে যাব, বুঝবে সেদিন বুঝবে, অস্তপারের সন্ধ্যাতারায় আমার খবর পুছবে- বুঝবে সেদিন বুঝবে! ছবি আমার বুকে বেঁধে পাগল হ’লে কেঁদে কেঁদে ফিরবে মর কানন গিরি, সাগর আকাশ বাতাস চিরি’ যেদিন আমায় খুঁজবে- বুঝবে সেদিন বুঝবে! ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] আসে বসন্ত ফুল বনে সাজে বনভূমি সুন্দরী; চরণে পায়েলা রুমুঝুমু মধুপ উঠিছে গুঞ্জরি ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] ফোটে যে ফুল আঁধার রাতে ঝরে ধুলায় ভোর বেলাতে আমায় তারা ডাকে সাথী আয়রে আয় সজল করুণ নয়ন তোলো দাও বিদায়।। ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] মহা - বিদ্রোহী রণক্লান্ত আমি সেই দিন হব শান্ত। যবে উৎপীড়িতের ক্রন্দন-রোল আকাশে-বাতাসে ধ্বনিবে না, অত্যাচারীর খড়ুগ কৃপাণ ভীম রণ, ভূমে রণিবে না- বিদ্রোহী রণক্লান্ত আমি সেই দিন হব শান্ত ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] হিন্দু না ওরা মুসলিম এই জিজ্ঞাসে কোন জন হে, কাণ্ডারি বল ডুবিছে মানুষ সন্তান মোর মা’র ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] যেদিন আমি হারিয়ে যাব, বুঝবে সেদিন বুঝবে অস্তপারের সন্ধ্যাতারায় আমার খবর পুঁছবে বুঝবে সেদিন বুঝবে। ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] গাইতে গিয়ে কন্ঠ ছিড়ে আসবে যখন কান্না বলবে সবাই- সেই যে পথিক তার শোনানো গান না?- আসবে ভেঙ্গে কান্না, পড়বে মন আমার সোহাগ কন্ঠে তোমার কাদবে বেহাগ পড়বে মনে আমার ফাকি অশ্রুহারা কঠিন আখি ঘন ঘন মুছবে, বুঝবে সেদিন বুঝবে। ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] ও কারা কোরাণ বেদ বাইবেল চুম্বিছে মরি মরি ও মুখ হইতে কেতাব গ্রন্থ নাও জোর করে কেড়ে যাহারা আনিল গ্রন্থ-কেতাব সেই মানুষেরে মেরে পুজিছে গ্রন্থ ভন্ডের দল! – মুর্খরা সব শোন মানুষ এনেছে গ্রন্থ; গ্রন্থ আনেনি মানুষ কোনও ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] আমার বুকের যে কাঁটা-ঘা তোমায় ব্যথা হানত্ সেই আঘাতই যাচবে আবার হয়ত হ’য়ে শ্রান– আসবে তখন পান’। হয়ত তখন আমার কোলে সোহাগ-লোভে প’ড়বে ঢ’লে, আপনি সেদিন সেধে কেঁদে চাপবে বুকে বাহু বেঁধে, চরণ চুমে পূজবে- বুঝবে সেদিন বুঝবে! ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] ছবি আমার বুকে বেধে পাগল হয়ে কেঁদে কেঁদে ফিরবে মরু কানন গিরি সাগর আকাশ বাতাশ চিরি সেদিন আমায় খুজবে বুঝবে সেদিন বুঝবে। ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] আবার গাঙ্গে আসবে জোয়ার, দুলবে তরী রঙ্গে সেই তরীতে হয়তো কেহ থাকবে তোমার সঙ্গে দুলবে তরী রঙ্গে, পড়বে মনে সে কোন রাতে এক তরীতে ছিলে সাথে এমনি গাঙে ছিল জোয়ার নদীর দুধার এমনি আধার তেমনি তরী ছুটবে- বুঝবে সেদিন বুঝবে। ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] তোমার সখার আসবে যেদিন এমনি কারা বন্ধ আমার মত কেদে কেদে হয়তো হবে অন্ধ সখার কারা বন্ধ, বন্ধু তোমার হানবে হেলা ভাঙ্গবে তোমার সুখের খেলা দীর্ঘ লো কাটবে না আর বইতে প্রাণ শ্রান্ত এ ভার সরন মনে যুঝবে বুঝবে সেদিন বুঝবে। ~ কাজী নজরুল ইসলাম\n" +
                        "\n" +
                        "[●] মৌ-লোভী যত মৌলবি আর মোল-লা’রা কন হাত নেড়ে দেব-দেবী নাম মুখে আনে সবে দাও পাজিটার জাত মেরে ফতোয়া দিলাম কাফের কাজী ও যদিও শহীদ হইতে রাজি ও আমপারা পড়া হামবড়া মোরা এখনও বেড়াই ভাত মেরে হিন্দুরা ভাবে পার্শী শব্দে কবিতা"));
        list.add(new Quotes(R.drawable.rabindranath,"রবীন্দ্রনাথ ঠাকুর","[●] ভালোবাসা যেখানে গভীর, নত হওয়া সেখানে গৌরবের। ~ রবীন্দ্রনাথ\n" +
                " [●] অবাধ্য যার স্ত্রী, জীবন তার দুর্বিষহ। ~ রবীন্দ্রনাথ\n" +
                " [●] বোবার শত্রু নেই একথা যে বলেছিলো, সে নিশ্চই অবিবাহিত ছিলো। ~ রবীন্দ্রনাথ\n" +
                " [●] প্রেমের আনন্দ থাকে স্বল্পক্ষণ, কিন্তু বেদনা থাকে সারাটি জীবন। ~ রবীন্দ্রনাথ\n" +
                " [●] তুমি যদি কাউকে ভালোবাস,তবে তাকে ছেড়ে দাও।যদি সে তোমার কাছে ফিরে আসে,তবে সে তোমারই ছিল।আর যদি ফিরে না আসে,তবে সে কখনই তোমার ছিল না। ~ রবীন্দ্রনাথ\n" +
                " [●] পরস্পর পরস্পরের জুলুম ঘাড় পেতে বহন করবে, এইজন্য তো বিবাহ । ~ রবীন্দ্রনাথ\n" +
                " [●] স্ত্রীর সঙ্গে বীরত্ব করে লাভ কি? আঘাত করলেও কষ্ট, আঘাত পেলেও কষ্ট। ~ রবীন্দ্রনাথ\n" +
                " [●] প্রহর শেষের আলোয় রাঙা সেদিন চৈত্রমাস, তোমার চোখে দেখেছিলেম আমার সর্বনাশ। ~ রবীন্দ্রনাথ\n" +
                " [●] মেয়েরা অল্প কারণে কাদতে জানে এবং বিনা কারণে হাসতে পারে, কারণ ব্যতীত কার্য হয় না, জগতের এই কড়া নিয়মটা কেবল পুরুষের পক্ষেই খাটে । ~ রবীন্দ্রনাথ\n" +
                " [●] শিমুল কাঠই হোক আর বকুল কাঠই হোক, আগুনের চেহারাটা একই । ~ রবীন্দ্রনাথ\n" +
                " [●] প্রেম মানুষ কে শান্তি দেয়। কিন্তু স্বস্তি দেয় না। প্রেমের মধ্যে ভয় না থাকলে প্রেমের রস নিবিড় হয় না। ~ রবীন্দ্রনাথ\n" +
                " [●] নাম মানুষকে বড় করে না, মানুষই নাম কে জাগিয়ে তোলে। ~ রবীন্দ্রনাথ\n" +
                " [●] আলো বলে, অন্ধকার তুই বড় কালো অন্ধকার বলে, ভাই তাই তুমি আলো। ~ রবীন্দ্রনাথ\n" +
                " [●] ঠিক সময়ে ঠিক কাজ করিতে কাহারও মনে পড়ে না, তাহার পরে বেঠিক সময়ে বেঠিক বাসনা লইয়া অস্থির হইয়া মরে। ~ রবীন্দ্রনাথ\n" +
                " [●] সেই ছেলেকে জীবন সঙ্গী করো, যার ভবিষ্যৎ ভালো। সেই মেয়েকে জীবন সঙ্গিনী করো, যার অতীত ভালো ~ রবীন্দ্রনাথ"));
        list.add(new Quotes(R.drawable.humayunahmed,"হুমায়ন আহাম্মেদ","[●] মাঝে-মাঝে রেগে যাওয়া ভাল। প্রচন্ড রাগলে শরীরের রোগজীবাণু মরে যায়। যারা ঘন ঘন রাগে তাদের অসুখবিসুখ হয় না বললেই চলে। ~ হুমায়ূন আহমেদ\n" +
                " [●] জীবনটা আসলেই অনেক সুন্দর। খুব বেশি সুন্দর। এতো বেশি সুন্দর যে মাঝে মাঝে অসহ্য লাগে। ~ হুমায়ূন আহমেদ\n" +
                " [●] আমরা জানি একদিন আমরা মরে যাব এই জন্যেই পৃথিবীটাকে এত সুন্দর লাগে। যদি জানতাম আমাদের মৃত্যু নেই তাহলে পৃথিবীটা কখনোই এত সুন্দর লাগতো না। ~ হুমায়ূন আহমেদ\n" +
                " [●] জীবনে কখনো কাউকে বিশ্বাস করতে যেও না। কারণ, যাকেই তুমি বিশ্বাস করবে সেই তোমাকে ঠকাবে। ~ হুমায়ূন আহমেদ\n" +
                " [●] ভালোবাসা একটা পাখি। যখন খাঁচায় থাকে তখন মানুষ তাকে মুক্ত করে দিতে চায়। আর যখন খোলা আকাশে তাকে ডানা ঝাপটাতে দেখে তখন খাঁচায় বন্দী করতে চায় । ~ হুমায়ূন আহমেদ\n" +
                " [●]  তুমি একটা খারাপ কাজ করেছো তার মানে তুমি একজন মানুষ, তুমি সেই খারাপ কাজটার জন্য অনুতপ্ত তার মানে তুমি একজন ভাল মানুষ ~ হুমায়ূন আহমেদ\n" +
                " [●] তুমি একটা খারাপ কাজ করেছো তার মানে তুমি একজন মানুষ, তুমি সেই খারাপ কাজটার জন্য অনুতপ্ত তার মানে তুমি একজন ভাল মানুষ। ~ হুমায়ূন আহমেদ\n" +
                " [●] মানুষের মনের ভাব কখনোই মুখে প্রতিফলিত হয় না।মুখের ওপর সর্বদা পর্দা থাকে।শুধু মানুষ যখন হাসে তখন পর্দা দূরীভূত হয়।হাস্যরত একজন মানুষের মুখে তার মনের ছায়া দেখা যায়। ~ হুমায়ূন আহমেদ\n" +
                " [●] একজন মানুষকে সত্যিকার ভাবে জানার উপায় হচ্ছে তার স্বপ্নটা জানা। ~ হুমায়ূন আহমেদ\n" +
                " [●] সব ক্ষমতা নিয়ে একজন দূরে বসে আছেন।ভুল বললাম-দূরে না,কাছেই বসে আছেন।খুব বেশি কাছে বলেই তাকে দেখা যায় না। ~ হুমায়ূন আহমেদ\n" +
                " [●] হাসি সবসময় যে সুখের প্রকাশ তা নয়, আপনি কতটা দু:খ লুকাতে পারেন তাও বুঝায়। ~ হুমায়ূন আহমেদ\n" +
                " [●] সরাসরি চোখের দিকে তাকিয়ে কেউ সহজে মিথ্যা বলতে পারে না। মিথ্যা সাধারনত বলতে হয় অন্যদিকে তাকিয়ে। যারা চোখের দিকে তাকিয়ে মিথ্যা বলতে পারে, তারা সত্যিকার অর্থেই ভয়ংকর। ~ হুমায়ূন আহমেদ\n" +
                " [●] প্রকৃতির কাছে কিছু চাইতে নেই, কারণ প্রকৃতি মানুষের কোনো ইচ্ছাই অপূর্ণ রাখে না। ~ হুমায়ূন আহমেদ\n" +
                " [●] বিপদ যখন আসে একটার পর একটা আসে।বিপদরা পাঁচ ভাই বোন।এদের মধ্যে খুব মিল।এই ভাইবোনরা কখনো একা কারো কাছে যায় না।প্রথম একজন যায় , তারপর অন্য ভাইবোনেরা উপস্থিত হয়। ~ হুমায়ূন আহমেদ\n" +
                " [●] তুমি যদি কাউকে হাসাতে পার, সে তোমাকে বিশ্বাস করবে. সে তোমাকে পছন্দও করতে শুরু করবে! ~ হুমায়ূন আহমেদ\n" +
                " [●] মিথ্যা কখনো এক লাইনে বলা যায় না। মিথ্যা বলতে হয় আটঘাঁট বেঁধে। সত্যি কথার কোন ডিটেল ওয়ার্কের প্রয়োজন হয় না, কিন্ত মিথ্যা মানেই প্রচুর ডিটেল কাজ ~ হুমায়ূন আহমেদ"));
        list.add(new Quotes(R.drawable.einstein,"আইনস্টাইন","[●] উৎসর্গকৃত জীবনই হচ্ছে স্বার্থক জীবন। ~ আইনস্টাইন\n" +
                " [●] ধর্মহীন বিজ্ঞান পঙ্গু আর বিজ্ঞানহীন ধর্ম অন্ধ। ~ আইনস্টাইন\n" +
                " [●] সফল মানুষ হবার চেষ্টা না করে, গুণী মানুষ হবার চেষ্টা কর। ~ আইনস্টাইন\n" +
                " [●] ভালোবাসায় পতনের জন্য কোনোভাবেই আমরা মহাকর্ষ-অভিকর্ষকে দায়ী করতে পারি না। ~ আইনস্টাইন\n" +
                " [●] যারা আমাকে সাহায্য করে নাই,আমি তাদের প্রতি কৃতঙ্গ। কারন তারা সাহায্য না করার কারনে আমি নিজের কাজ নিজে করতে শিখেছি। ~ আইনস্টাইন\n" +
                " [●] যারা আমাকে সাহায্য করে নাই,আমি তাদের প্রতি কৃতঙ্গ। কারন তারা সাহায্য না করার কারনে আমি নিজের কাজ নিজে করতে শিখেছি। ~ আইনস্টাইন\n" +
                " [●] স্কুলে যা শেখানো হয়, তার সবটুকুই ভুলে যাবার পর যা থাকে তা-ই হলো শিক্ষা। ~ আইনস্টাইন\n" +
                " [●] এই পৃথিবী কখনো খারাপ মানুষের খারাপ কর্মের জন্য ধ্বংস হবে না, যারা খারাপ মানুষের খারাপ কর্ম দেখেও কিছু করেনা তাদের জন্যই পৃথিবী ধ্বংস হবে। ~ আইনস্টাইন\n" +
                " [●] আমাদের রহস্যময়তার পরীক্ষণে প্রাপ্ত সবচেয়ে সৌন্দর্যময় জিনিসগুলো হলো শিল্প, বিজ্ঞান এবং বন্ধুত্ব। ~ আইনস্টাইন\n" +
                " [●] যে কেউ ,যে কখনও ভুল করেনা। সে নতুন কিছু করার চেষ্টা করে না। ~ আইনস্টাইন\n" +
                " [●] একজন সুন্দর, আকর্ষণীয় রমণীর পাশে ২ ঘণ্টা বসে থাকুন, দেখবেন সময় উড়ে চলে গেছে!! এবার গ্রীষ্মের গরমের মাঝে রাস্তায় ২ মিনিট হাঁটুন, মনে হবে আপনি অনন্তকাল ধরে হাঁটছেন! ~ আইনস্টাইন\n" +
                " [●] বোকামি আর প্রতিভার মধ্যে পার্থক্য হল- প্রতিভার সীমা আছে, বোকামির কোন সীমা নেই। ~ আইনস্টাইন\n" +
                " [●] আপনি যদি অন্যদের অনুসরন করে তাদের সাহায্য নিয়ে চলতে থাকেন তবে হয়তো একদিন তার জায়গায় পৌঁছাতে পারবেন। কিন্তু আপনি যদি নিজের পথটা নিজেই তৈরী করে চলেন তাহলে হয়তো এমন এক সাফল্যমন্ডিত যায়গায় পৌঁছাবেন যেখানে আজ পর্যন্ত কেউই পৌঁছাতে পারেন নি ~ আইনস্টাইন"));
        list.add(new Quotes(R.drawable.marktowen,"মার্ক টোয়েন","[●] একটা টেলিগ্রাফ আবিষ্কারের পিছনে হাজারো মানুষের অবদান থাকে; একটা স্টিম ইঞ্জিন, একটা ফোনোগ্রাফ, একটা ফোটোগ্রাফ, একটা টেলিফোন বা অন্য যে কোন গুরুত্বপূর্ণ আবিষ্কারের পিছনেও তাই থাকে — কিন্তু শেষ লোকটাই কৃতিত্ব পায় আর আমরা বাকিদের কথা ভুলে যাই। ~ মার্ক টোয়েন\n" +
                " [●] আমি একবার আমার ১২ জন বন্ধুকে এই টেলিগ্রামটা পাঠিয়েছিলাম - সব ফাঁস হয়ে গেছে - তাড়াতাড়ি পালাও! তাদের সবাই শহর ছেড়ে ভেগে গিয়েছিল সাথেসাথে। ~ মার্ক টোয়েন\n" +
                " [●] আপনাকে আঘাত করতে হলে, আপনার শত্রু আর আপনার বন্ধু – দুজনেরই সম্মিলিত উদ্যোগ লাগেঃ একজন আড়ালে আপনার নিন্দা করবে আর আরেকজন সেই খবরটা আপনার কাছে বহন করে আনবে। ~ মার্ক টোয়েন\n" +
                " [●] একটা ক্লাসিক হচ্ছে সেই বইটা যা সবাই নিজের পড়া বলে আশা করে, কিন্তু কেউই পড়তে চায় না। ~ মার্ক টোয়েন\n" +
                " [●] ১লা এপ্রিল সেই দিবস যেদিন বছরের অন্য ৩৬৪ দিন আমরা আসলে কি – সেইটা উদযাপন করি। ~ মার্ক টোয়েন\n" +
                " [●] সবসময় সঠিক কাজটি করুন। এটা কিছু লোককে খুশি করবে, আর বাকিদেরকে করবে অবাক। ~ মার্ক টোয়েন\n" +
                " [●] সাহস হচ্ছে ভয়কে প্রতিরোধ করা, ভয়কে জয় করা, ভয়শুন্যতা নয়। ~ মার্ক টোয়েন\n" +
                " [●] স্বাস্থ্য ঠিক রাখার একমাত্র পথ হচ্ছে আপনি যা খেতে চান না তা খেতে হবে এবং যা করতে চান না তা করতে হবে। ~ মার্ক টোয়েন\n" +
                " [●] রাজনীতিবিদরা ডায়াপারের মত। এদেরকে নিয়মিত বদলাতে হয়। একই কারনে। ~ মার্ক টোয়েন\n" +
                " [●] সত্যবাদিতা স্মৃতিশক্তির উপর চাপ কমায় ~ মার্ক টোয়েন"));
        list.add(new Quotes(R.drawable.humayunazad,"হুমায়ুন আজাদ","[●] পাকিস্তানিদের আমি অবিশ্বাস করি, যখন তারা গোলাপ নিয়ে আসে, তখনও। ~ হুমায়ুন আজাদ\n" +
                " [●] এখানে অসতেরা জনপ্রিয়, সৎ মানুষেরা আক্রান্ত। ~ হুমায়ুন আজাদ\n" +
                " [●] একজন চাষী বা নদীর মাঝি সাংস্কৃতিকভাবে যতোটা মূল্যবান, সারা সচিবালয় ও মন্ত্রীপরিষদও ততোটা মূল্যবান নয়। ~ হুমায়ুন আজাদ\n" +
                " [●] বাঙালি আন্দোলন করে, সাধারণত ব্যর্থ হয়, কখনোকখনো সফল হয়; এবং সফল হওয়ার পর মনে থাকে না কেনো তারা আন্দোলন করেছিলো। ~ হুমায়ুন আজাদ\n" +
                " [●] বাস্তব কাজ অনেক সহজ অবাস্তব কাজের থেকে ; আট ঘন্টা একটানা শ্রম গাধাও করতে পারে, কিন্তু একটানা এক ঘন্টা স্বপ্ন দেখা রবীন্দ্রনাথের পক্ষেও অসম্ভব। ~ হুমায়ুন আজাদ\n" +
                " [●] এদেশে সবাই শিক্ষানুরাগী ও সমাজসেবক : দারোগার শোকসংবাদেও লেখা হয়, ‘তিনি শিক্ষানুরাগী ও সমাজসেবক ছিলেন’। ~ হুমায়ুন আজাদ\n" +
                " [●] ক্ষুধা ও সৌন্দর্যবোধের মধ্যে গভীর সম্পর্ক রয়েছে। যে-সব দেশে অধিকাংশ মানুষ অনাহারী, সেখানে মাংসল হওয়া রূপসীর লক্ষণ; যে-সব দেশে প্রচুর খাদ্য আছে, সেখানে মেদহীন হওয়া রূপসীর লক্ষণ। এজন্যেই হিন্দি আর বাঙলা ফিল্মের নায়িকাদের দেহ থেকে মাংস চর্বি উপচে পড়ে। ক্ষুধার্ত দর্শকেরা সিনামা দেখে না, মাংস ও চর্বি দেখে ক্ষুধা নিবৃত্ত করে। ~ হুমায়ুন আজাদ\n" +
                " [●] সব ধরনের অভিনয়ের মধ্যে শ্রেষ্ঠ হচ্ছে রাজনীতি; রাজনীতিকেরা অভিনয় করে সবচেয়ে বড় মঞ্চে ও পর্দায়। ~ হুমায়ুন আজাদ\n" +
                " [●] বাঙালির জাতিগত আলস্য ধরা পড়ে ভাষায়। বাঙালি ‘দেরি করে’, ‘চুরি করে’, এমনকি ‘বিশ্রাম করে’। বিশ্রাম ও বাঙালির কাছে কাজ। ~ হুমায়ুন আজাদ\n" +
                " [●] দ্বিতীয়, তৃতীয়, চতুর্থ, পঞ্চম প্রেম বলে কিছু নেই। মানুষ যখন প্রেমে পড়ে, তখন প্রতিটি প্রেমই প্রথম প্রেম। ~ হুমায়ুন আজাদ\n" +
                " [●] একবার রাজাকার মানে চিরকাল রাজাকার; কিন্তু একবার মুক্তিযোদ্ধা মানে চিরকাল মুক্তিযোদ্ধা নয় ~ হুমায়ুন আজাদ"));
        list.add(new Quotes(R.drawable.kalam,"এ পি জে আব্দুল কালাম","[●] স্বপ্ন সত্যি করার আগে স্বপ্ন দেখতেহবে। ~ এপিজে আবদুল কালাম\n" +
                " [●] ওটা স্বপ্ন নয় যেটা তুমি ঘুমিয়ে দেখ, স্বপ্ন তা-ই যা তোমাকে ঘুমোতে দেয় না। ~ এপিজে আবদুল কালাম\n" +
                " [●] একটি দেশকে যদি দুর্নীতিমুক্ত করতে হয় ও দেশের সব মানুষকে যদি সুন্দর মনের করে গড়ে তুলতে হয় তাহলে আমি মনে করি সমাজের তিন ধরনের মানুষ সে কাজটি করতে পারেন। তারা হলেন- একজন বাবা, একজন মা এবং একজন শিক্ষক। ~ এপিজে আবদুল কালাম\n" +
                " [●] সফলতার গল্পে কেবল একটি বার্তা থাকে। কিন্তু ব্যর্থতার গল্পে সফল হওয়ার উপায় থাকে। ~ এপিজে আবদুল কালাম\n" +
                " [●] বৃষ্টির সময় প্রত্যেকটি পাখিই কোথাও না কোথাও আশ্রয় পায়। কিন্তু ঈগল মেঘের উপর দিয়ে উড়ে বৃষ্টিকে এড়িয়ে যায়। ~ এপিজে আবদুল কালাম\n" +
                " [●] আমি সুদর্শন নই। কিন্তু আমি আমার হাত তার জন্য বাড়িয়ে দিতে পারি যার সাহায্য প্রয়োজন। সৌন্দর্য হৃদয়ে, মুখে নয়। ~ এপিজে আবদুল কালাম\n" +
                " [●] কাউকে হারিয়ে দেয়াটা খুব সহজ, কিন্তু কঠিন হলো কারো মন জয়। ~ এপিজে আবদুল কালাম\n" +
                " [●] শুধুমাত্র সাফল্যর গল্প পড়বেন না, এখানে শুধু একটা বার্তাই পাবেন। ব্যথতার গল্প গুলো পড়েন তাহলে সফল হওয়ার অনেক গুলো আইডিয়া ও পেয়ে জাবেন। ~ এপিজে আবদুল কালাম\n" +
                " [●] আপনি আপনার ভবিষ্যৎ পরিবর্তন করে দিতে পারবেন না, কিন্তু আপনি আপনার অভ্যাসগুলো পরিবর্তন করতে পারবেন। আর এটাই আপনার ভবিষ্যৎ পরিবর্তন করে দিবে। ~ এপিজে আবদুল কালাম\n" +
                " [●] একটা ভালো বই ১০০ জন বন্ধুর সমান, কিন্তু একজন ভালো বন্ধু একটা লাইব্রেরীর সমান। ~ এপিজে আবদুল কালাম\n" +
                " [●] আত্মবিশ্বাস ও কঠোর পরিশ্রম ব্যথতা নামক রোগকে মারার সবচেয়ে বড় ওষুধ। এটাই আপনাকে একজন সফলকাম মানুষে পরিণত করবে। ~ এপিজে আবদুল কালাম\n" +
                " [●] নিজেকে একা মনে হলে আকাশের দিকে তাকাও। আমরা একা নই। পৃথিবীটা আমাদের বন্ধু। যারা কাজ করে ও স্বপ্ন দেখে প্রকৃতি তাঁদের সাহায্য করে। ~ এপিজে আবদুল কালাম\n" +
                " [●] যদি সূর্য হতে চাও তবে সূর্যের মতো নিজেকে পোড়াও। ~ এপিজে আবদুল কালাম\n" +
                " [●] মানুষের জীবনে প্রতিবন্ধকতা থাকা দরকার। বাধা না থাকলে সফলতা উপভোগ করা যায় না। ~ এপিজে আবদুল কালাম\n" +
                " [●] জীবন এক কঠিন খেলা। সত্যিকারের মানুষ হয়ে উঠতে পারলেই এ খেলায় জেতা যায়। ~ এপিজে আবদুল কালাম\n" +
                " [●] তিনজনই পারেন একটি দেশ বা জাতিকে বদলাতে। তাঁরা হলেন, বাবা, মা ও শিক্ষক। ~ এপিজে আবদুল কালাম\n" +
                " [●] কেউ যখন অসাধারণ হওয়ার জন্য জ্ঞান অর্জন করে তখন সে আসলে আর সবার মতোই সাধারণ হয়ে যায়। ~ এপিজে আবদুল কালাম\n" +
                " [●] নেতা সমস্যায় ভয় পাবেন না। বরং সমস্যার মোকাবিলা করতে জানবেন। তাঁকে কাজ করতে হবে সততার সঙ্গে। ~ এপিজে আবদুল কালাম\n" +
                " [●] প্রেসিডেন্ট হিসেবে আমার জন্য সবচেয়ে কঠিন কাজ ছিল আদালতের দেওয়া মৃত্যুদণ্ডের রায়ে সম্মতি দেওয়া। আমি মনে করি পারিপার্শ্বিক অবস্থার কারণে মানুষ অপরাধ করে। অপরাধের জন্য দায়ী সমাজ বা অর্থনৈতিক ব্যবস্থা। কিন্তু সেই ব্যবস্থাকে আমরা শাস্তি দিতে পারি না। শাস্তি দিই ব্যবস্থার শিকার মানুষদের। ~ এপিজে আবদুল কালাম\n" +
                " [●] স্বপ্ন, স্বপ্ন, স্বপ্ন। স্বপ্ন দেখে যেতে হবে। স্বপ্ন না দেখলে কাজ করা যায় না। ~ এপিজে আবদুল কালাম\n" +
                " [●] যারা পরিশ্রম করেন সৃষ্টিকর্তা তাঁদের সাহায্য করেন। ~ এপিজে আবদুল কালাম\n" +
                " [●] স্বপ্নবাজরাই সীমা ছাড়িয়ে যেতে পারেন। ~ এপিজে আবদুল কালাম\n" +
                " [●] উন্নত ও নিরাপদ ভারত রেখে যেতে পারলেই পরের প্রজন্ম আমাদের মনে রাখবে। ~ এপিজে আবদুল কালাম\n" +
                " [●] মন থেকে যারা কাজ করে না তাঁদের জীবন ফাঁপা। সাফল্যের স্বাদ তাঁরা পায় না। ~ এপিজে আবদুল কালাম\n" +
                " [●] সত্যি হওয়ার আগ পর্যন্ত স্বপ্ন দেখে যেতে হবে। ~ এপিজে আবদুল কালাম\n" +
                " [●] কেবল বিশেষ সময়ে নয় সবসময় নিজের সেরাটা দেওয়ার চেষ্টা করে যেতে হবে। ~ এপিজে আবদুল কালাম\n" +
                " [●] তরুণদের নতুন চিন্তা করতে হবে, নতুন কিছু ভাবতে হবে, অসম্ভবকে সম্ভব করতে হবে। তবেই তারুণ্যের জয় হবে। ~ এপিজে আবদুল কালাম\n" +
                " [●] উদার ব্যক্তিরা ধর্মকে ব্যবহার করে বন্ধুত্বের হাত বাড়ান। কিন্তু সংকীর্ণমনস্করা ধর্মকে যুদ্ধের অস্ত্র হিসেবে ব্যবহার করে। ~ এপিজে আবদুল কালাম\n" +
                " [●] এখন বিজ্ঞান জানতে ইংরেজি জানা দরকার। কিন্তু আমি বিশ্বাস করি দুই দশকের মধ্যে আমাদের ভাষায় বিজ্ঞানচর্চা শুরু হবে। আর তখন আমরা জ্ঞানবিজ্ঞানে জাপানিদের মতো এগিয়ে যাব। ~ এপিজে আবদুল কালাম\n" +
                " [●] সেই ভালো শিক্ষার্থী যে প্রশ্ন করে। প্রশ্ন না করলে কেউ শিখতে পারে না। শিক্ষার্থীদের প্রশ্ন করার সুযোগ দিতে হবে। ~ এপিজে আবদুল কালাম\n" +
                " [●] যদি আমরা স্বাধীন হতে না পারি কেউ আমাদের শ্রদ্ধা করবে না। ~ এপিজে আবদুল কালাম\n" +
                " [●] গভীর দুঃখে বা প্রচণ্ড আনন্দে মানুষ কবিতা লেখে ~ এপিজে আবদুল কালাম\n" +
                " [●] বিজ্ঞান মানুষের জন্য উপহার। ধ্বংসের জন্য বিজ্ঞান নয়। ~ এপিজে আবদুল কালাম\n" +
                " [●] স্বপ্ন, স্বপ্ন, স্বপ্ন। স্বপ্ন কাজের অনুপ্রেরণা জোগায়। ~ এপিজে আবদুল কালাম\n" +
                " [●] আমি সুপুরুষ নই। কিন্তু যখন কেউ বিপদে পড়েন আমি সাহায্যের হাত বাড়িয়ে দিই। সৌন্দর্য থাকে মানুষের মনে। চেহারায় নয়। ~ এপিজে আবদুল কালাম\n" +
                " [●] যদি তুমি তোমার কাজকে স্যালুট কর, দেখো তোমায় আর কাউকে স্যালুট করতে হবে না। কিন্তু তুমি যদি তোমার কাজকে অসম্মান কর, অমর্যাদা কর, ফাঁকি দাও, তাহলে তোমায় সবাইকে স্যালুট করতে হবে। ~ এপিজে আবদুল কালাম\n" +
                "\n" +
                "[●] আমি আবিষ্কার করলাম সবচেয়ে দ্রুতগতিতে বেশী বিক্রি হয়ে যায় সিগারেট ও বিড়ি। অবাক হয়ে ভাবতাম, গরিব মানুষেরা তাদের কঠোর পরিশ্রমে উপার্জিত অর্থ এভাবে ধোঁয়া গিলে উড়িয়ে দেয় কেন। -উইংস অব ফায়ার-বই ~ এপিজে আবদুল কালাম\n" +
                "\n" +
                "[●] আকাশের দিকে তাকাও। আমরা একা নই। পুরো মহাবিশ্ব আমাদের প্রতি বন্ধুত্বসুলভ। যারা স্বপ্ন দেখে এবং কাজ করে শুধুমাত্র তাদেরকেই শ্রেষ্ঠটা দেওয়ার জন্য চক্রান্তে লিপ্ত এই বিশ্ব। ~ এপিজে আবদুল কালাম\n" +
                " [●] আমরা প্রত্যেকেই ভেতরে ঐশ্বরিক আগুন নিয়ে জন্মায়। আমাদের চেষ্টা করা উচিত এই আগুনে ডানা যুক্ত করার এবং এর মঙ্গলময়তার আলোয় জগত পূর্ণ করা। -উইংস অব ফায়ার-বই ~ এপিজে আবদুল কালাম\n" +
                " [●] আমরা শুধু সাফল্যের উপরেই গড়ি না, আমরা ব্যর্থতার উপরেও গড়ি। -উইংস"));
        list.add(new Quotes(R.drawable.mandela,"নেলসন ম্যান্ডেলা","[●] আমার সফলতার ভিত্তিতে আমাকে বিচার করোনা, আমাকে বিচার কর আমার ব্যর্থতা এবং ব্যর্থতার পর ঘুরে দাঁড়ানোর ভিত্তিতে। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] আমি সাধু নই, তবে যদি সাধুকে এমন এক পাপী হিসেবে বিবেচনা কর, যে সৎ হবার জন্য তার চেষ্টা চালিয়ে যাচ্ছে, তাহলে আমি তাই। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] ঘৃণা মনকে অন্ধকার করে দেয়। কৌশলের পথ রুদ্ধ করে দেয়। নেতাদের ঘৃণা করা সাজে না। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] যদি কেউ ঘৃণা করতে শেখে তাহলে সে ভালবাসা শিখে নিতে পারে। ঘৃণা নয়, মানব হৃদয়ে স্বাভাবিকভাবে ভালবাসার জন্ম হয়। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] ঘৃণা নিয়ে কেউ জন্ম গ্রহণ করে না। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] সাহসী মানুষের শান্তির জন্য ক্ষমা করতে ভীত নয়। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] পৃথিবীতে প্রতিশোধ গ্রহণের মাধ্যমে আপনি যতটা অর্জন করতে পারবেন, তার চেয়ে ঢের বেশী অর্জন করতে পারবেন ক্ষমা প্রদর্শনের মাধ্যমে। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] যেখানে এক সময় থাকে বেদনার বসবাস, খেলাধুলা সেথায় করতে পারে আশাবাদের চাষ। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] পেছন থেকে নেতৃত্ব দাও- আর সাথে অন্যদের বিশ্বাস দাও যে নেতার আছে সম্মুখসারিতে। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] আমি বর্ণবাদকে ঘৃণা করি কারণ এটা একটা বর্বর বিষয়, তা সে কালো বা সাদা যে কোন মানুষের কাছ থেকে আসুক না কেন। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] সবসময়, যতক্ষণ না কাজ সমাধা হচ্ছে ততক্ষণ পর্যন্ত তা এক অসম্ভব বিষয় বলে মনে হয়। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] যে কোন কিছুতে ভীত নয়; সে নয়, বরঞ্চ যে ভয়কে জয় করে সেই হচ্ছে প্রকৃত সাহসী। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] সম্মান তাদের প্রাপ্য, যারা কখনো সত্যকে পরিত্যাগ করে না, এমনকি যখন পরিস্থিতি অন্ধকারচ্ছন্ন এবং বেদনাদায়ক। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] কেবল শৃঙ্খলহীন হওয়া নয়, বরং স্বাধীন হওয়া মানে শ্রদ্ধা এবং অন্যের স্বাধীনতা বৃদ্ধির সাথে বসবাস ~ নেলসন ম্যান্ডেলা\n" +
                " [●] শিক্ষা হচ্ছে সবচেয়ে শক্তিশালী অস্ত্র, যার মধ্যে দিয়ে পৃথিবীকে বদলে ফেলা যায়। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] বলা হয়ে থাকে যে সত্যিকার অর্থে কেউ একটি জাতিকে জানতে পারে না যতক্ষণ না কেউ একজন এর কারাগারে বন্দী থাকে। ~ নেলসন ম্যান্ডেলা\n" +
                " [●] যখন একজন মানুষ বিবেচনা করা যে নিজ জাতি এবং স্বদেশের প্রতি সে তার দায়িত্ব পালন করেছে, তখন সে শান্তিতে মৃত্যু বরণ করতে পারে। ~ নেলসন ম্যান্ডেলা\n"));


        list.add(new Quotes(R.drawable.bani,"চিরন্তণী বাণী","[●] পৃথিবীর বিখ্যাত লোকদের কিছু বিখ্যাত উক্তি যা আমাদের জীবনে প্রয়োগ করলে হয়তো আমাদের জীবন অনেক সুন্দর হয়ে উঠবে। মাত্র দুটি পন্থায় সফল হওয়া যায়! একটি হচ্ছে সঠিক লক্ষ্য নির্ধারণ করা, ঠিক যা তুমি করতে চাও। আর দ্বিতীয়টি হচ্ছে, সেই লক্ষ্যে কাজ করে যাওয়া॥ ~ মারিও কুওমো।\n" +
                " [●] অনুকরণ নয়, অনুসরণ নয়, নিজেকে খুঁজুন, নিজেকে জানুন, নিজের পথে চলুন॥ ~ ডেল কার্নেগি।\n" +
                " [●] হ্যাঁ এবং না কথা দুটো সবচেয়ে পুরনো এবং সবচেয়ে ছোট। কিন্তু এ কথা দুটো বলতেই সবচেয়ে বেশি ভাবতে হয়॥ ~ পীথাগোরাস।\n" +
                " [●] ঝগড়া চরমে পৌঁছার আগেই ক্ষান্ত হও॥ ~ হযরত সোলায়মান (আঃ)।\n" +
                " [●] তুমি যদি কোনো লোককে জানতে চাও, তা হলে তাকে প্রথমে ভালবাসতে শেখো॥ ~ লেলিন।\n" +
                " [●] একজন আহত ব্যক্তি তার যন্ত্রনা যত সহজে ভুলে যায়, একজন অপমানিত ব্যক্তি তত সহজে অপমান ভোলে না॥ ~ জর্জ লিললো।\n" +
                " [●] দুর্ভাগ্যবান তারাই যাদের প্রকৃত বন্ধু নেই॥ ~ অ্যারিস্টটল।\n" +
                " [●] বিশ্বাস জীবনকে গতিময়তা দান করে, আর অবিশ্বাস জীবনকে দুর্বিষহ করে তোলে॥ ~ মিল্টন।\n" +
                " [●] আল্লাহর ভয় মানুষকে সকল ভয় হতে মুক্তি দেয়॥ ~ ইবনে সিনা।\n" +
                " [●] স্বপ্নপূরণই জীবনের একমাত্র লক্ষ্য নয়। তাই বলে, স্বপ্নকে ত্যাগ করে নয়, তাকে সঙ্গে নিয়ে চলো। স্বপ্ন ছাড়া জীবন অর্থহীন॥ ~ ব্রায়ান ডাইসন।\n" +
                " [●] এই পৃথিবী কখনো খারাপ মানুষের খারাপ কর্মের জন্য ধ্বংস হবে না। যারা খারাপ মানুষের খারাপ কর্ম দেখেও কিছু করেনা তাদের জন্যই পৃথিবী ধ্বংস হবে॥ ~ আইনস্টাইন।\n" +
                " [●] নতুন দিনই নতুন চাহিদা ও নতুন দৃষ্টিভঙ্গির জন্ম দেয়॥ ~ জন লিভেগেট।\n" +
                " [●] যেখানে পরিশ্রম নেই সেখানে সাফল্যও নেই॥ ~ উইলিয়াম ল্যাংলয়েড।\n" +
                " [●] সত্য একবার বলতে হয়; সত্য বারবার বললে মিথ্যার মতো শোনায়। মিথ্যা বারবার বলতে হয়; মিথ্যা বারবার বললে সত্য ৰলে মনে হয়॥ ~ হুমায়ূন আজাদ।\n" +
                " [●] যে নিজেকে অক্ষম ভাবে, তাকে কেউ সাহায্য করতে পারে না॥ ~ জন এন্ডারসন।\n" +
                " [●] চিন্তা কর বেশি, বল অল্প এবং লেখ তার চেয়েও কম॥ ~ জন রে।\n" +
                " [●] সবচেয়ে কঠিন কাজ হচ্ছে নিজেকে চেনা এবং সবচেয়ে সহজ কাজ হচ্ছে অন্যদেরকে উপদেশ দেয়া॥ ~ থেলিস।\n" +
                " [●] যে নিজেকে দমন করতে পারে না সে নিজের জন্যেও বিপদজনক এবং অন্য সবার জন্যেও॥ ~ থেলিস।\n" +
                " [●] সফলতা সুখের চাবিকাঠি নয় বরং সুখ হল সফলতার চাবিকাঠি। আপনার কাজকে যদি আপনি মনে প্রানে ভালবাসতে পারেন অর্থাৎ যদি আপনি নিজের কাজ নিয়ে সুখী হন তবে আপনি অবশ্যই সফল হবেন॥ ~ Albert Schweitzer.\n" +
                " [●] আমি বলবনা আমি ১০০০ বার হেরেছি, আমি বলবো যে আমি হারার ১০০০ টি কারণ বের করেছি॥ ~ টমাস আলভা এডিসন।\n" +
                " [●] যে বিজ্ঞানকে অল্প জানবে সে নাস্তিক হবে, আর যে ভালো ভাবে বিজ্ঞানকে জানবে সে অবশ্যই ঈশ্বরে বিশ্বাসী হবে॥ ~ ফ্রান্সিস বেকন।\n" +
                " [●] সত্যকে ভালবাস কিন্তু ভুলকে ক্ষমা কর॥ ~ ভলতেয়ার।\n" +
                " [●] আমি স্বপ্ন দেখেছিলাম, সেইস্বপ্নে আস্থা ছিল। আর আমি কাজটা ভালোবাসতাম। ফেসবুক বিফল হলেও আমার ভালোবাসাটা থাকত। জীবনে একটা স্বপ্ন থাকতে হয়, সেই স্বপ্নকে ভালোও বাসতে হয়॥ ~ মার্ক জুকারবার্গ।\n" +
                " [●] যে পরিশ্রমী সে অন্যের সহানুভূতির প্রত্যাশী নয়॥ ~ এডমণ্ড বার্ক।\n" +
                " [●] পৃথিবীতে সবাই জিনিয়াস; কিন্তু আপনি যদি ১ টি মাছকে তার গাছ বেয়ে উঠার সামর্থ্যের উপর বিচার করেন তাহলে সে সারা জীবন নিজেকে শুধু অপদার্থই ভেবে যাবে॥ ~ আইনস্টাইন।\n" +
                " [●] আমি ব্যর্থতা কে মেনে নিতে পারি কিন্তু আমি চেষ্টা না করাকে মেনে নিতে পারিনা॥ ~ মাইকেল জর্ডান।\n" +
                " [●] প্রত্যেককে বিশ্বাস করা বিপদজনক; কিন্তু কাউকে বিশ্বাস না করা আরো বেশী বিপদজনক॥ ~ আব্রাহাম লিংকন।\n" +
                " [●] যারা আমাকে সাহায্য করতে মানা করে দিয়েছিল আমি তাদের প্রতি কৃতজ্ঞ। কারন তাদের না এর জন্যই আজ আমি নিজের কাজ নিজে করতে শিখেছি॥ ~ আইনস্টাইন।\n" +
                " [●] যারা বলে অসম্ভব, অসম্ভব তাদের দুয়ারেই বেশি হানা দেয়॥ ~ জন সার্কল।\n" +
                " [●] আমরা ভাবি দেশে যত ছেলে পাশ হচ্ছে তত শিক্ষার বিস্তার হচ্ছে। পাশ করা আর শিক্ষিত হওয়া এক বস্তু নয়, এ সত্য স্বীকার করতে আমরা কুন্ঠিত হই॥ ~ প্রমথ চৌধুরী।\n" +
                " [●] তোমার বন্ধু হচ্ছে সে, যে তোমার সব খারাপ দিক জানে; তবুও তোমাকে পছন্দ করে॥ ~ অ্যালবার্ট হুবার্ড।\n" +
                " [●] স্কুলে যা শেখানো হয়, তার সবটুকুই ভুলে যাবার পর যা থাকে; তাই হলো শিক্ষা॥ ~ অ্যালবার্ট আইনস্টাইন।\n" +
                " [●] আমি আপনাকে কখনও ভালবাসতে না বলে যুদ্ধ করতে বলি। কারণ যুদ্ধে হয় আপনি বাঁচবেন না হয় মরবেন। কিন্তু ভালবাসাতে না পারবেন বাঁচতে; না মরতে॥ ~ এডলফ হিটলার।\n" +
                " [●] যারা কাপুরুষ তারাই ভাগ্যের দিকে চেয়ে থাকে, পুরুষ চায় নিজের শক্তির দিকে। তোমার বাহু, তোমার মাথা তোমাকে টেনে তুলবে, তোমার কপাল নয়॥ ~ ডঃ লুৎফর রহমান।\n" +
                " [●] বাঙালি সমালোচনা সহ্য করে না; নিজেকে কখনো সংশোধন করেনা। নিজের দোষত্রুটি সংশোধন না করে সেগুলোকে বাড়ানোকেই বাঙালি মনে করে সমালোচনার যথাযথ উত্তর॥ ~ হুমায়ুন আজাদ।\n" +
                " [●] কাল আমার পরীক্ষা। কিন্তু এটা আমার কাছে বিশেষ কোন ব্যাপারই না, কারন শুধুমাত্র পরীক্ষার খাতার কয়েকটা পাতাই আমার ভবিষ্যৎ নির্ধারন করতে পারেনা॥ ~ টমাস আলভা এডিসন।\n" +
                " [●] সবাই অনেকদিন বাঁচতে চায়, কিন্তু কেউই বুড়ো হতে চায় না॥ ~ জোনাথন সুইফট।\n" +
                " [●] ছেলেদের মদ্ধে বন্ধুত্ব নষ্টের অন্যতম দুইটি কারণ- টাকা এবং মেয়ে। সব সময় এই দুইটি জিনিস বন্ধুত্ব থেকে দূরে রাখতে চেষ্টা করুন॥ পৃথিবী জুড়ে প্রতিটি নরনারী এখন মনে করে তাদের জীবন ব্যর্থ, কেননা তারা অভিনেতা বা অভিনেত্রী হতে পারেনি॥ ~ হুমায়ুন আজাদ।\n" +
                " [●] তুমি যখন প্রেমে পড়বে তখন আর তোমার ঘুমাতে ইচ্ছে করবেনা; কারণ তখন তোমার বাস্তব জীবন স্বপ্নের চেয়ে আনন্দময় হবে॥ ~ Dr. Seuss.\n" +
                " [●] একবার পরীক্ষায় কয়েকটা বিষয়ে আমি ফেল করেছিলাম কিন্তু আমার বন্ধু সব বিষয়েই পাশ করে। এখন সে মাইক্রোসফটের একজন ইঞ্জিনিয়ার আর আমি মাইক্রোসফটের প্রতিষ্ঠাতা॥ ~ বিল গেটস।\n" +
                " [●] টাকার বিনিময়ে শিক্ষা অর্জনের চেয়ে অশিক্ষিত থাকা ভাল॥ ~ সক্রেটিস।\n" +
                " [●] জন্মদিনের উৎসব পালন করাটা বোকামি। জীবন থেকে একটা বছর ঝরে গেল, সে জন্যে অনুতাপ করাই উচিত॥"));
        list.add(new Quotes(R.drawable.shakespeare,"শেক্সপিয়ার","[●] সাফল্যের ৩টি শর্তঃ - অন্যের থেকে বেশী জানুন! - অন্যের থেকে বেশী কাজ করুন! - অন্যের থেকে কম আশা করুন! ~ শেক্সপিয়ার\n" +
                " [●] তোমার একটু অভিমানের জন্য যদি কারো চোঁখে জল আসে, তবে মনে রেখো, তার চেয়ে বেশি কেউ তোমাকে ভালোবাসে না। ~ শেক্সপিয়ার\n" +
                " [●] তোমার বন্ধু যখন বিপদে থাকবে , তখন সে না ডাকলেও তাকে সাহায্য কর। কিন্তু, যখন সে খুশিতে থাকবে , তখন সে না ডাকলে যেওনা। ~ শেক্সপিয়ার\n" +
                " [●] শেক্সপিয়ার কে একজন জিজ্ঞেস করলো তুমি বিয়ে করেছ তোমার চেয়ে বেশি বয়সের একটি মেয়েকে। তোমার লজ্জা করেনা।  শেক্সপিয়ার তাকে একটি ক্যালেন্ডার এনে দেখালেন আর বললেন আপনি বলতে পারবেন সপ্তাহের সাতটি দিনের মধ্যে কোনটা যুবক আর কোনটা বৃদ্ধ?  আসলে ভালবাসার কোন বয়স হয়না আপনি যে কাউকেই ভালবাসতে পারেন। ~ শেক্সপিয়ার\n" +
                " [●] প্রয়োজন খারাপ কেও ভাল করে তোলে। ~ শেক্সপিয়ার\n" +
                " [●] মহত্ত্বের প্রতীক হচ্ছে ক্ষমাশীলতা। ~ শেক্সপিয়ার\n" +
                " [●] জীবন জীবন মানেই অনিশ্চিত ভ্রমণ। ~ শেক্সপিয়ার\n" +
                " [●] আমি নষ্ট করেছি সময়, এখন সময় নষ্ট করছে আমায়। ~ শেক্সপিয়ার\n" +
                " [●] ভীরুরা তাদের প্রকৃত মৃত্যুর আগেই বহুবার মরে, কিন্তূ সাহসীরা জীবনে মাত্র একবারই মৃত্যুর স্বাদ গ্রহণ করে থাকে ~ শেক্সপিয়ার"));
        list.add(new Quotes(R.drawable.banis,"বিখ্যাত বাণী","[●] জীবনে মাত্র তিনটি জিনিসের প্রয়োজন তা হল - বই, বই, বই ~ তলস্তয়\n" +
                " [●] যারা সব সময় সব কিছুর অর্থ খোঁজেন তারা সবসময় সৎ কাজ করেন ~ স্কট\n" +
                " [●] দুঃখ যত বড়ই হোক সময় তা নরম করে আনে ~ সিসেরো\n" +
                " [●] তুমি বদ্ধ প্রাণীর কাছ থেকে শুধু বিষ পান করতে শিখবে ~ উইলিয়াম ব্লেক\n" +
                " [●] ঘরের কোন আসবাবপত্র বইয়ের মত সুন্দর নয় ~ সিডনি স্মিথ\n" +
                " [●] ভালো বই আত্মশুদ্ধির শ্রেষ্ঠ উপায় ~ রবীন্দ্রনাথ ঠাকুর\n" +
                " [●] আমরা যখন বই সংগ্রহ করি তখন আমরা আনন্দকেই সংগ্রহ করি ~ ভিনসেন্ট ষ্টারেই\n" +
                " [●] পরিশ্রমের পরে যেটুকু বিশ্রাম পাওয়া যায় সেটুকুই পরিশ্রমের পুরুস্কার স্বরুপ ~ জনরে\n" +
                " [●] কর্ম দক্ষতাই মানুষের সর্বাপেক্ষা বড় বন্ধু ~ দাওয়ানি\n" +
                " [●] বই জ্ঞানের প্রতীক বই আনন্দের প্রতীক ~ জসিম উদ্দিন\n" +
                " [●] কেউ তোমাকে দাম না দিক তুমি তোমার কাজ করে যাও ~ হজরত আলি (রা)\n" +
                " [●] মানুষের বিশ্বাস সুকোমল কেকের মত, যেকোন মুহূর্তে সহজেই ভেঙ্গে যেতে পারে ~ টমাস হুড\n" +
                " [●] জীবন থেকে একটা দিন চলে যাওয়া মানে জীবন থেকে একটা দিন ঝরে যাওয়া ~ রবার্ট ব্রাউনিং\n" +
                " [●] স্নেহান্ধ হয়ে দায়িত্বকে এড়ানো অবিবেচকের কাজ ~ পল রিচটার\n" +
                " [●] বাধা পেলে শক্তি নিজেকে চিনতে পারে আর চিনতে পারলেই আর ঠেকানো যায় না ~ রবীন্দ্রনাথ ঠাকুর\n" +
                " [●] অন্যর দুর্ভোগে শুধু সান্ত্বনাই দিওনা নিজেও সাবধান হইয়ো ~ সিসেরো\n" +
                " [●] পাখি যখন উড়ে তখন তার ডানার উপর বিশ্বাস রেখেই উড়ে ~ ডরথি বেরি\n" +
                " [●] জীবনে মাত্র দুটি ট্র্যাজেডি একটা হল আকাঙ্ক্ষা করে কিছু না পাওয়া অন্যটা কিছু পাওয়া ~ বার্নাডশ\n" +
                " [●] নিজ অর্জিত অর্থ ব্যয় করে যে আনন্দ পাওয়া যায় অন্য প্রদত্ত অর্থে তার বিন্দু মাত্র পাওয়া যায়না ~ স্যামুয়েল রজার\n" +
                " [●] যে জাতি মনে বড় নয় সে জাতি জ্ঞানে বড় নয় ~ প্রমথ চৌধুরী\n" +
                " [●] মানুষ মরে গেলে পচে যায় আর বেঁচে থাকলে বদলায় ~ মনির চৌধুরী\n" +
                " [●] জীবনের ব্যাপক সময় ধরে শিক্ষা গ্রহণ করা হয়। শিক্ষার শেষ নেই ~ কুপার\n" +
                " [●] কাজকে ভালোবাসলে কাজের মধ্যে আনন্দ পাওয়া যায় ~ মার্শাল\n" +
                " [●] যে সৎ, নিষ্ঠা তার কোন অনিষ্ঠ করতে পারেনা ~ শেখ সাদি\n" +
                " [●] মানুষ বই দিয়ে অতিত ও ভবিষ্যতের মধ্যে সাকু বেধে দিয়েছে ~ রবীন্দ্রনাথ ঠাকুর\n" +
                " [●] কারো অতীত কে জেনো না বর্তমানকে জানো এবং সে জানাই যথেষ্ট ~ এডিসন\n" +
                " [●] মানুষের জীবনে এমন সময় আসে তখন সে যে সৃষ্টির সেরা জীব মানতে কষ্ট হয় ~ এম এম তরু\n" +
                " [●] সতর্কতা হচ্ছে নিরাপত্তার জননী ~ এডমার্ক বার্গ\n" +
                " [●] একটি ভালো বই হচ্ছে সর্বশ্রেষ্ঠ বন্ধু আজ এবং চিরকালের জন্য ~ এফ টুপার\n" +
                " [●] ভালো বই পড়িবার সময় মনে থাকেনা বই পড়িতেছি ~ রবীন্দ্রনাথ ঠাকুর\n" +
                " [●] ভিতুরাই পাপ কর্মে লিপ্ত হয় ~ ডগলাস\n" +
                " [●] প্রাণীদের সবচেয়ে ভালো দিক হল তারা কথা কম বলে ~ থন্টন ওয়াইল্ডার\n" +
                " [●] প্রতিটি আলোর পিছনেই ছায়া থাকে ~ জন গে\n" +
                " [●] নিজের ফাঁদে যে ধরা পড়ে তার লজ্জার শেষ নেই ~ পোপ\n" +
                " [●] প্রমান না পেয়ে কাউকে অবিশ্বাস করোনা ~ সিডনি স্মিথ\n" +
                " [●] জ্ঞানের শক্তির চেয়ে বড় শক্তি নেই ~ লা ফন্টেইন\n" +
                " [●] যে খারাপ তার মধ্যে খারাপ হওার যন্ত্রণাও আছে ~ আর এইচ রায়হান\n" +
                " [●] মূর্খতা এমন এক পাপ সারা জিবনে যার প্রায়শ্চিত হয় না ~ আল বুখারি\n" +
                " [●] সত্য বলার স্বাধীনতা সবচেয়ে সুন্দর ও শোভন জিনিস ~ মোঃ শাহাদাৎ\n" +
                " [●] প্রিয়জনের তাগিদ বিশ্রাম নিতে জানেনা ~ কুপার\n" +
                " [●] বিপদ চলে যাওয়া মাত্রই আমরা খোদা কে ভুলে যাই ~ জনরে\n" +
                " [●] রুপে মানুষের চক্ষু জুড়ায় কিন্তু গুন হৃদয় জয় করে ~ পোপ\n" +
                " [●] কথা বলতে অনেকক্ষণ চিন্তা কর তারপর মুখ থেকে বের কর, অতঃপর তা কাজে পরিনত কর ~ প্লেটো\n" +
                " [●] যে বই সম্পর্কে তোমার প্রকৃত ইচ্ছা ও কৌতূহল জাগে সেই বই পড়বে ~ জনসন\n" +
                " [●] একটি বই ফুটন্ত ফুলের সঙ্গে , দূরের পথের সঙ্গে এবং স্তম্ভের চূড়ার সঙ্গে তুলনা করা চলে ~ আলেকজেন্ডার স্মি"));


        recyclerView.setLayoutManager(new LinearLayoutManager(this));
        MyAdapter listAdapter = new MyAdapter(this);
        listAdapter.setListQuotes((ArrayList<Quotes>) list);
        recyclerView.setAdapter(listAdapter);
    }
    public boolean onCreateOptionsMenu(Menu menu) {
        getMenuInflater().inflate(R.menu.item_menu, menu);
        return super.onCreateOptionsMenu(menu);
    }
    public boolean onOptionsItemSelected(@NonNull MenuItem item) {
        int id = item.getItemId();
        switch (id) {
            case R.id.action_share:
                Toast.makeText(this, "Share", Toast.LENGTH_SHORT).show();
                break;
            case R.id.action_star:
                Toast.makeText(this, "open playstore", Toast.LENGTH_SHORT).show();
                break;
        }
        return super.onOptionsItemSelected(item);
    }

}